BeginnerSyllabus.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Course Description</a></li>
<li><a href="#orgheadline2">2. Requirements</a></li>
<li><a href="#orgheadline5">3. Topics covered</a>
<ul>
<li><a href="#orgheadline3">3.1. Up and Running</a></li>
<li><a href="#orgheadline4">3.2. Free and Open Source Community: Where can I find help?</a></li>
</ul>
</li>
<li><a href="#orgheadline9">4. Imperative Programming through Turtles</a>
<ul>
<li><a href="#orgheadline6">4.1. Design Seminar</a></li>
<li><a href="#orgheadline7">4.2. Data Structures</a></li>
<li><a href="#orgheadline8">4.3. Higher order functions</a></li>
</ul>
</li>
</ul>
</div>
</div>


# Course Description<a id="orgheadline1"></a>

This course is for people with no coding experience who are trying to
learn to code for the first time. The course is as much about solving
problems as it is about the semantics and syntax of Clojure.

# Requirements<a id="orgheadline2"></a>

-   Laptop
-   up to date operating system
-   Java 8 or greater

# Topics covered<a id="orgheadline5"></a>

## Up and Running<a id="orgheadline3"></a>

-   Introduction to Leiningen (Clojure build tool)
-   Using the REPL (\*\*R\*\*ead \*\*E\*\*val \*\*P\*\*rint \*\*L\*\*oop)
-   Namespaces in Clojure

## Free and Open Source Community: Where can I find help?<a id="orgheadline4"></a>

-   Meetups
-   Hackers hours
    -   LispNYC
    -   ClojureNYC
-   Google the error
-   Stackoverflow
-   IRC: Freenode
    -   Webchat to IRC
    -   \#Clojure channel
    -   \#Clojure-beginners

# [Imperative Programming through Turtles](https://github.com/ClojureBridge/welcometoclojurebridge/blob/master/outline/TURTLE-SAMPLES.md)<a id="orgheadline9"></a>

-   How to walk turtles
    -   initial state
    -   `undo`, `clean` and `home`
    -   `state`
    -   `doc`
-   Basic Movement - forward, backward right and left
-   Multiple turtles
    -   tilt
-   Add one more turtle and give them commands
-   Move all five turtles - Introduction to functions
    -   `map` higher order functions
-   Write a function that adds turtles
-   Functions with parameters
-   control flow with `if` to check input
-   Functions with five turtles moving in different directions
    -   use `map`
    -   use recursion

## Design Seminar<a id="orgheadline6"></a>

-   Designing your own program
-   Collages and work flow
-   User experience
-   Think pair share
    -   What to do when you are stuck

## Data Structures<a id="orgheadline7"></a>

-   Immutable state
-   Sequence and collection abstractions
-   Lists, vectors, and hash-maps
-   Sequence functions
-   Key-value functions
-   Lazy evaluation

## Higher order functions<a id="orgheadline8"></a>

-   `map`, `reduce`, `filter`, `apply`, etc.
-   Solving problems functionally
